### 

The score of this competition is accuracy.

In [2]:
import os


os.getcwd()

'C:\\Users\\E17538\\OneDrive - Uniper SE\\Desktop\\DailyActivities\\FAD\\Advpy\\s5'

In [4]:
import zipfile


path_to_zip_file = os.getcwd() + '\\titanic.zip'
directory_to_extract_to = os.getcwd()
with zipfile.ZipFile(path_to_zip_file, 'r') as zip_ref:
    zip_ref.extractall(directory_to_extract_to)

In [203]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split, KFold
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import accuracy_score, confusion_matrix, f1_score
from sklearn import metrics
import xgboost
import lightgbm
import catboost
from catboost import CatBoostClassifier, CatBoostRegressor
from warnings import filterwarnings
import pickle
import category_encoders as ce
from sklearn.feature_selection import RFE
from xgboost import XGBClassifier
from lightgbm import LGBMClassifier
filterwarnings('ignore')

### Understanding the data

In [7]:
df_samp = pd.read_csv('gender_submission.csv')
df_samp.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [8]:
df_train = pd.read_csv('train.csv')
df_test = pd.read_csv('test.csv')

In [9]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [12]:
df_train.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [13]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
len(df_train)

891

In [33]:
df_test.isnull().any()

PassengerId    False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare            True
Cabin           True
Embarked       False
dtype: bool

In [34]:
df_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [31]:
len(df_test)

418

### Encoding and data cleaning

In [28]:
for col in df_train.columns:
    print('Feature {} has {} not null unique values of type {}'.format(col, df_train[col].nunique(dropna=True), df_train[col].dtype.name))

Feature PassengerId has 891 not null unique values of type int64
Feature Survived has 2 not null unique values of type int64
Feature Pclass has 3 not null unique values of type int64
Feature Name has 891 not null unique values of type object
Feature Sex has 2 not null unique values of type object
Feature Age has 88 not null unique values of type float64
Feature SibSp has 7 not null unique values of type int64
Feature Parch has 7 not null unique values of type int64
Feature Ticket has 681 not null unique values of type object
Feature Fare has 248 not null unique values of type float64
Feature Cabin has 147 not null unique values of type object
Feature Embarked has 3 not null unique values of type object

We have five categorical features: Name, Sex, Ticket, Cabin and Embarked.

Here we take a closer look at each to decide which one to keep and what type of encoding to apply.

In [24]:
df_train['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [25]:
df_train['Cabin'].head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [26]:
df_train['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

In [27]:
df_train['Sex'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

+ Sex and Embarked have low number of values, therefore, I will apply one-hot encoding on them.
+ Name is not an important factor in making the predictive model. However, we will keep it to check if our hypothesis is true.
+ We will use label encoding for Cabin and Ticket. They both have NA values, therefore it is important to handle them to make sure labelencoder does not assign unique values to NA.
+ To apply the same encoding on both train and test, we will concat them both first, apply the encoders, and split them back.

In [44]:
df_train_drp = df_train.drop('Survived', axis=1)
y = df_train['Survived']
df_train_drp.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [46]:
df_total = pd.concat([df_train_drp, df_test], axis=0, ignore_index=True)

In [47]:
df_total.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [48]:
df_total.isnull().sum()

PassengerId       0
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

**Dataframe test has one null value in feature 'Fare'. We study this feature to decide what encoding to apply.**

In [49]:
df_total['Fare'].nunique(dropna=True)

281

In [50]:
df_total['Fare'].head()

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [52]:
df_total['Fare'].dtype.name

'float64'

Fare is a floating value. We will use interpolation for training the predictive model.

### Applying encoding to the concatinated dataframe

#### One-hot encoding

In [57]:
sex_col = pd.get_dummies(df_total['Sex'], prefix='Sex')
sex_col

      Sex_female  Sex_male
0              0         1
1              1         0
2              1         0
3              1         0
4              0         1
...          ...       ...
1304           0         1
1305           1         0
1306           0         1
1307           0         1
1308           0         1

[1309 rows x 2 columns]

In [62]:
embarked_col = pd.get_dummies(df_total['Embarked'], dummy_na=True, prefix='Embarked')
embarked_col

      Embarked_C  Embarked_Q  Embarked_S  Embarked_nan
0              0           0           1             0
1              1           0           0             0
2              0           0           1             0
3              0           0           1             0
4              0           0           1             0
...          ...         ...         ...           ...
1304           0           0           1             0
1305           1           0           0             0
1306           0           0           1             0
1307           0           0           1             0
1308           1           0           0             0

[1309 rows x 4 columns]

In [63]:
embarked_col[embarked_col['Embarked_nan']==1]

     Embarked_C  Embarked_Q  Embarked_S  Embarked_nan
61            0           0           0             1
829           0           0           0             1

#### Applying lable encoder

In applying lable encoder we must be sure null values are not assigned any numbers. For this we can use either of the two following approaches:

1. Apply label encoder only to str values.
2. Make a pandas series and only apply label encoder to not null values. This requires reconstrucitng the dataframe by keeping the index values as well.

In [68]:
df_total['Cabin']

0        NaN
1        C85
2        NaN
3       C123
4        NaN
        ...
1304     NaN
1305    C105
1306     NaN
1307     NaN
1308     NaN
Name: Cabin, Length: 1309, dtype: object

In [85]:
le = LabelEncoder()
df_total['Cabin'] = df_total['Cabin'].map(lambda x: le.fit_transform([x])[0] if type(x)==str else x)
# le.transform([x])[0] outout is numpy array. Each will be a single value in an array. Therefore, [0].

In [87]:
df_total['Cabin'].head()

0      NaN
1    106.0
2      NaN
3     70.0
4      NaN
Name: Cabin, dtype: float64

In [114]:
df_total['Ticket']

0                A/5 21171
1                 PC 17599
2         STON/O2. 3101282
3                   113803
4                   373450
               ...
1304             A.5. 3236
1305              PC 17758
1306    SOTON/O.Q. 3101262
1307                359309
1308                  2668
Name: Ticket, Length: 1309, dtype: object

In [127]:
df_total['Ticket'].isnull().sum()

0

In [125]:
le_ticket = LabelEncoder()
df_total['Ticket'] = le_ticket.fit_transform(df_total['Ticket'])

In [126]:
df_total['Ticket']

0       720
1       816
2       914
3        65
4       649
       ...
1304    711
1305    834
1306    872
1307    579
1308    262
Name: Ticket, Length: 1309, dtype: int32

#### The other way to apply label encoding while keeping null values

In [124]:
# le_cabin_2 = LabelEncoder()
# series = df_total['Cabin'].apply(str)
# series = pd.Series(
#     data= le_cabin_2.fit_transform(series[series.notnull()]]),
#     index = series[series.notnull()].index
# )
# series

#### Encoding Name

Name should not have any impact on the survival probability of a passanger. To check this hypothesis, we encode name as well to make sure we are right.

For name we apply catboost encoder

In [130]:
# cat_features = ['Name']
# cat_enc = ce.CatBoostEncoder(cols=cat_features)

# cat_enc.fit_transform( df_tota)

# train = train.join(target_enc.transform(train[cat_features]).add_suffix('_cb'))

In [131]:
le_name = LabelEncoder()
df_total['Name'] = le_name.fit_transform(df_total['Name'])

In [132]:
df_total.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin2,Ticket2
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S,NaN,720
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C,106.0,816
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S,NaN,914
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S,70.0,65
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S,NaN,649

In [134]:
df_total.drop(['Cabin2', 'Ticket2'], axis=1, inplace=True)

In [135]:
df_total.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S

In [139]:
df_t_sex = pd.concat([df_total, sex_col], axis=1)
df_t_sex.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S,0,1
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C,1,0
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S,1,0
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S,1,0
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S,0,1

In [151]:
df_final = pd.concat([df_t_sex, embarked_col], axis = 1)
df_final.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S,0,1,0,0,1,0
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C,1,0,1,0,0,0
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S,1,0,0,0,1,0
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S,1,0,0,0,1,0
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S,0,1,0,0,1,0

In [153]:
df_final.drop(['Sex', 'Embarked'], axis=1, inplace=True)
df_final.head()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
0,1,3,155,22.0,1,0,720,7.2500,NaN,0,1,0,0,1,0
1,2,1,286,38.0,1,0,816,71.2833,106.0,1,0,1,0,0,0
2,3,3,523,26.0,0,0,914,7.9250,NaN,1,0,0,0,1,0
3,4,1,422,35.0,1,0,65,53.1000,70.0,1,0,0,0,1,0
4,5,3,22,35.0,0,0,649,8.0500,NaN,0,1,0,0,1,0

In [142]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [154]:
len(df_train)

891

In [155]:
len(df_test)

418

In [210]:
df_train_enc = df_final.iloc[:len(df_train)]
df_train_enc.head()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
0,1,3,155,22.0,1,0,720,7.2500,NaN,0,1,0,0,1,0
1,2,1,286,38.0,1,0,816,71.2833,106.0,1,0,1,0,0,0
2,3,3,523,26.0,0,0,914,7.9250,NaN,1,0,0,0,1,0
3,4,1,422,35.0,1,0,65,53.1000,70.0,1,0,0,0,1,0
4,5,3,22,35.0,0,0,649,8.0500,NaN,0,1,0,0,1,0

In [208]:
df_test_enc = df_final.iloc[len(df_train):]
df_test_enc.head()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
891,892,3,638,34.5,0,0,376,7.8292,NaN,0,1,0,1,0,0
892,893,3,1266,47.0,1,0,582,7.0000,NaN,1,0,0,0,1,0
893,894,2,837,62.0,0,0,184,9.6875,NaN,0,1,0,1,0,0
894,895,3,1278,27.0,0,0,366,8.6625,NaN,0,1,0,0,1,0
895,896,3,543,22.0,1,1,338,12.2875,NaN,1,0,0,0,1,0

### Feature Selection

In [209]:
## Using recursive feature elimination
from sklearn.feature_selection import RFE
from xgboost import XGBClassifier

In [211]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=1)
selector = RFE(xgb_model, n_features_to_select=8, step=1)
selector = selector.fit(df_train_enc, y)
selector.support_
# selector.ranking_

[00:08:37] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:39] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:40] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:42] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:44] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:45] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:46] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:08:48] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

array([False,  True, False,  True, False, False,  True,  True,  True,
        True,  True,  True, False, False, False])

In [205]:
selector.ranking_

array([2, 1, 4, 1, 3, 6, 1, 1, 1, 1, 1, 1, 5, 7, 8])

In [206]:
df_train_enc.columns

Index(['PassengerId', 'Pclass', 'Name', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Sex_female', 'Sex_male', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 'Embarked_nan'],
      dtype='object')

In [212]:
[item for item in zip(df_train_enc.columns, selector.support_)]

[('PassengerId', False),
 ('Pclass', True),
 ('Name', False),
 ('Age', True),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', True),
 ('Cabin', True),
 ('Sex_female', True),
 ('Sex_male', True),
 ('Embarked_C', True),
 ('Embarked_Q', False),
 ('Embarked_S', False),
 ('Embarked_nan', False)]

In [165]:
selector.get_params()

{'estimator__objective': 'binary:logistic',
 'estimator__use_label_encoder': True,
 'estimator__base_score': None,
 'estimator__booster': None,
 'estimator__colsample_bylevel': None,
 'estimator__colsample_bynode': None,
 'estimator__colsample_bytree': 0.85,
 'estimator__gamma': None,
 'estimator__gpu_id': None,
 'estimator__importance_type': 'gain',
 'estimator__interaction_constraints': None,
 'estimator__learning_rate': 0.008,
 'estimator__max_delta_step': None,
 'estimator__max_depth': 8,
 'estimator__min_child_weight': None,
 'estimator__missing': None,
 'estimator__monotone_constraints': None,
 'estimator__n_estimators': 2000,
 'estimator__n_jobs': 5,
 'estimator__num_parallel_tree': None,
 'estimator__random_state': 2020,
 'estimator__reg_alpha': 2.01,
 'estimator__reg_lambda': 0.05,
 'estimator__scale_pos_weight': 0.1,
 'estimator__subsample': None,
 'estimator__tree_method': None,
 'estimator__validate_parameters': None,
 'estimator__verbosity': 1,
 'estimator': XGBClassifier(base_score=None, booster=None, colsample_bylevel=None,
               colsample_bynode=None, colsample_bytree=0.85, gamma=None,
               gpu_id=None, importance_type='gain', interaction_constraints=None,
               learning_rate=0.008, max_delta_step=None, max_depth=8,
               min_child_weight=None, missing=None, monotone_constraints=None,
               n_estimators=2000, n_jobs=5, num_parallel_tree=None,
               random_state=2020, reg_alpha=2.01, reg_lambda=0.05,
               scale_pos_weight=0.1, subsample=None, tree_method=None,
               validate_parameters=None, verbosity=1),
 'n_features_to_select': 8,
 'step': 1,
 'verbose': 0}

In [213]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=1)
selector = RFE(xgb_model, n_features_to_select=2, step=10)
selector = selector.fit(df_train_enc, y)
[item for item in zip(df_train_enc.columns, selector.support_)]

[00:09:40] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:09:42] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:09:43] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

[('PassengerId', False),
 ('Pclass', True),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', False),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_female', False),
 ('Sex_male', True),
 ('Embarked_C', False),
 ('Embarked_Q', False),
 ('Embarked_S', False),
 ('Embarked_nan', False)]

#### As expected PassengerId and Name are not features having impact on target value.

#### One-hot encoding is not a proper way to determine important features, as it creates a lot of extra features.

<div style='color:blue'>
Interestingly taking the first two important features on one-hot encoded data will return Sex_male but not Sex_female. This means sex was an important factor in survival rate, and if you were male it would play a role in surviving or not. But if you were female your survival rate would be insensitive to your gender. Let's check this hypothesis.</div>

In [215]:
df_train.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [219]:
df_train[['Sex', 'Survived']].groupby(by='Sex').mean()

        Survived
Sex
female  0.742038
male    0.188908

**In train data set on average 74% of female passangers survived, while this value was only 18% for males.**

### Using lable encoding on XGBoost for feature selection

In [167]:
df_total.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S

In [169]:
for col in df_total.columns:
    print('Feature {} is of type {}'.format(col, df_total[col].dtype))

Feature PassengerId is of type int64
Feature Pclass is of type int64
Feature Name is of type int32
Feature Sex is of type object
Feature Age is of type float64
Feature SibSp is of type int64
Feature Parch is of type int64
Feature Ticket is of type int32
Feature Fare is of type float64
Feature Cabin is of type float64
Feature Embarked is of type object
Feature Sex_le is of type int32

In [170]:
for col in df_total.columns:
    if df_total[col].dtype == 'object':
        df_total[col] = df_total[col].apply(str)
        le = LabelEncoder()
        df_total[col+'_le'] = le.fit_transform(df_total[col])

In [171]:
for col in df_total.columns:
    print('Feature {} is of type {}'.format(col, df_total[col].dtype))

Feature PassengerId is of type int64
Feature Pclass is of type int64
Feature Name is of type int32
Feature Sex is of type object
Feature Age is of type float64
Feature SibSp is of type int64
Feature Parch is of type int64
Feature Ticket is of type int32
Feature Fare is of type float64
Feature Cabin is of type float64
Feature Embarked is of type object
Feature Sex_le is of type int32
Feature Embarked_le is of type int32

In [172]:
df_total.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_le,Embarked_le
0,1,3,155,male,22.0,1,0,720,7.2500,NaN,S,1,2
1,2,1,286,female,38.0,1,0,816,71.2833,106.0,C,0,0
2,3,3,523,female,26.0,0,0,914,7.9250,NaN,S,0,2
3,4,1,422,female,35.0,1,0,65,53.1000,70.0,S,0,2
4,5,3,22,male,35.0,0,0,649,8.0500,NaN,S,1,2

In [182]:
df_total_le = df_total.drop(['Sex', 'Embarked'], axis=1)

### Applying RFE to label-encoded dataframe

In [183]:
df_train_le_enc = df_total_le.iloc[:len(df_train)]
df_test_le_enc = df_total_le.iloc[len(df_train):]

In [184]:
len(df_train_le_enc)

891

In [185]:
len(df_test_le_enc)

418

In [186]:
df_train_le_enc.head(2)

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_le,Embarked_le
0,1,3,155,22.0,1,0,720,7.2500,NaN,1,2
1,2,1,286,38.0,1,0,816,71.2833,106.0,0,0

In [220]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=1)
selector = RFE(xgb_model, n_features_to_select=1, step=1)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[00:21:45] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:46] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:47] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:48] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:49] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:50] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:51] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:52] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:53] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:54] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:21:55] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

[('PassengerId', False),
 ('Pclass', False),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', False),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_le', True),
 ('Embarked_le', False)]

#### 2 most important features

In [221]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=1)
selector = RFE(xgb_model, n_features_to_select=2, step=1)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[00:22:01] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:02] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:04] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:05] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:07] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:08] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:09] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:10] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:11] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:11] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

[('PassengerId', False),
 ('Pclass', True),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', False),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_le', True),
 ('Embarked_le', False)]

#### 3 most important features

In [243]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=0)
selector = RFE(xgb_model, n_features_to_select=3, step=1, verbose=0)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[('PassengerId', False),
 ('Pclass', True),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', False),
 ('Fare', False),
 ('Cabin', True),
 ('Sex_le', True),
 ('Embarked_le', False)]

#### 5 most important features

In [244]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=0)
selector = RFE(xgb_model, n_features_to_select=5, step=1, verbose=0)
selector = selector.fit(df_train_le_enc, y)
selector.support_

array([False,  True, False, False, False, False,  True,  True,  True,
        True, False])

In [223]:
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[('PassengerId', False),
 ('Pclass', True),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', True),
 ('Cabin', True),
 ('Sex_le', True),
 ('Embarked_le', False)]

In [224]:
xgb_model = XGBClassifier(random_state=2020, n_estimators=2000, max_depth=8, colsample_bytree=0.85, missing=None,n_jobs=5,
                          scale_pos_weight=0.1, learning_rate=0.008, reg_alpha=2.01, reg_lambda=0.05, verbosity=1)
selector = RFE(xgb_model, n_features_to_select=8, step=1)
selector = selector.fit(df_train_le_enc, y)
selector.support_

[00:22:20] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:22] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:23] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.
[00:22:24] WARNING: C:/Users/Administrator/workspace/xgboost-win64_release_1.3.0/src/learner.cc:1061: Starting in XGBoost 1.3.0, the default evaluation metric used with the objective 'binary:logistic' was changed from 'error' to 'logloss'. Explicitly set eval_metric if you'd like to restore the old behavior.

array([False,  True,  True,  True, False, False,  True,  True,  True,
        True,  True])

In [225]:
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[('PassengerId', False),
 ('Pclass', True),
 ('Name', True),
 ('Age', True),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', True),
 ('Cabin', True),
 ('Sex_le', True),
 ('Embarked_le', True)]

### Comparing selected features by changing algorithm

### Using lightgbm

In [229]:
from lightgbm import LGBMClassifier
import warnings
warnings.filterwarnings('ignore')

In [238]:
lgb = lightgbm.LGBMClassifier(random_state=2020, n_estimators=2000, num_leaves=31, learning_rate=0.011, 
                              colsample_bytree=0.85, max_depth=8, verbose=-1, importance='gain', 
                              silent=True, verbose_eval = -1)
# lgb.verbose=-1
selector = RFE(lgb, n_features_to_select=1, step=1, verbose=0)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[LightGBM] [Warning] Unknown parameter: verbose_eval
[LightGBM] [Warning] Unknown parameter: importance
[LightGBM] [Warning] Accuracy may be bad since you didn't explicitly set num_leaves OR 2^max_depth > num_leaves. (num_leaves=31).

[('PassengerId', False),
 ('Pclass', False),
 ('Name', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_le', False),
 ('Embarked_le', False)]

#### In XGBoost most important feature was sex. While in Lightgbm it is ticket!

In [240]:
lgb = lightgbm.LGBMClassifier(random_state=2020, n_estimators=2000, num_leaves=31, learning_rate=0.011, 
                              colsample_bytree=0.85, max_depth=8, verbose=-1, importance='gain', 
                              silent=True, verbose_eval = -1)
# lgb.verbose=-1
selector = RFE(lgb, n_features_to_select=2, step=1, verbose=0)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[('PassengerId', False),
 ('Pclass', False),
 ('Name', True),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_le', False),
 ('Embarked_le', False)]

#### Most important features from lgbm perspective are ticket and name!

#### 3 most important features

In [241]:
lgb = lightgbm.LGBMClassifier(random_state=2020, n_estimators=2000, num_leaves=31, learning_rate=0.011, 
                              colsample_bytree=0.85, max_depth=8, verbose=-1, importance='gain', 
                              silent=True, verbose_eval = -1)
# lgb.verbose=-1
selector = RFE(lgb, n_features_to_select=3, step=1)
selector = selector.fit(df_train_le_enc, y)
[item for item in zip(df_train_le_enc.columns, selector.support_)]

[('PassengerId', True),
 ('Pclass', False),
 ('Name', True),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Ticket', True),
 ('Fare', False),
 ('Cabin', False),
 ('Sex_le', False),
 ('Embarked_le', False)]

#### Lgbm has detected ticket, name and passangerId as most important features!!!

This can be imporved by droping these values from the train dataframe. However, it also shows the algorithm is not suitable for this problem

In [246]:
df_train_lgbm = df_train_le_enc.drop(['PassengerId',  'Name', 'Ticket'], axis=1)
df_train_lgbm.head()

   Pclass   Age  SibSp  Parch     Fare  Cabin  Sex_le  Embarked_le
0       3  22.0      1      0   7.2500    NaN       1            2
1       1  38.0      1      0  71.2833  106.0       0            0
2       3  26.0      0      0   7.9250    NaN       0            2
3       1  35.0      1      0  53.1000   70.0       0            2
4       3  35.0      0      0   8.0500    NaN       1            2

In [247]:
lgb = lightgbm.LGBMClassifier(random_state=2020, n_estimators=2000, num_leaves=31, learning_rate=0.011, 
                              colsample_bytree=0.85, max_depth=8, verbose=-1, importance='gain', 
                              silent=True, verbose_eval = -1)
selector = RFE(lgb, n_features_to_select=1, step=1)
selector = selector.fit(df_train_lgbm, y)
[item for item in zip(df_train_lgbm.columns, selector.support_)]

[('Pclass', False),
 ('Age', False),
 ('SibSp', False),
 ('Parch', False),
 ('Fare', True),
 ('Cabin', False),
 ('Sex_le', False),
 ('Embarked_le', False)]

#### Even after droping the irrelevant features which were all selected by lgbm as important, still it returns 'Fare' as an important feature! This algorithm is not suitable for this problem!

### Applying catboost and RFE

In [ ]:
lgb.fit(X_train, y_train, eval_set=(X_val, y_val), verbose=False, early_stopping_rounds=50)
xgb_model.fit(X_train, y_train, eval_set=[(X_train, y_train), (X_val, y_val)], early_stopping_rounds=10, verbose=150 )